Repository: eduNEXT-collab/xblock-exam-question-bank
Catalog: examquestionbank/conf/locale/*/LC_MESSAGES/text.po
Languages: es_419

source: Display Name
es_419: Nombre para mostrar

source: The display name for this component.
es_419: El nombre para mostrar de este componente.

source: Count
es_419: Cantidad

source: Enter the number of components to display to each student. Set it to -1 to display all components.
es_419: Ingresa el número de componentes a mostrar a cada estudiante. Establece -1 para mostrar todos los componentes.

source: Count Per Collection
es_419: Cantidad por colecciones

source: Optional limit on the number of problems to display from each collection.
es_419: Ingresa el número de componentes a mostrar por cada colección.

source: Collections Info
es_419: Información de colecciones

source: To update this field click Refresh Collections in the XBlock.
es_419: Para actualizar este campo haz click sobre Actualizar colecciones en el XBlock.

source: Maximum Exam Attempts
es_419: Número máximo de intentos del examen

source: Maximum number of times a student can attempt this entire exam. Set to -1 for unlimited attempts.
es_419: Número máximo de veces que un estudiante puede intentar este examen completo. Establece -1 para intentos ilimitados.

source: Current Attempt
es_419: Intento actual

source: Current attempt number for this student
es_419: Número de intento actual para este estudiante

source: Attempt History
es_419: Historial de intentos

source: History of all attempts with scores and timestamps
es_419: Historial de todos los intentos con calificaciones y marcas de tiempo

source: Minimum Passing Score (%)
es_419: Puntuación mínima para aprobar (%)

source: Minimum percentage required to pass the exam (1-100)
es_419: Porcentaje mínimo requerido para aprobar el examen (1-100)

source: Is Attempting
es_419: Está intentando

source: Indicates whether the student is currently attempting the exam
es_419: Indica si el estudiante está actualmente intentando el examen

source: Add Problems
es_419: Agregar problemas

source: from your content library to this bank.
es_419: desde tu biblioteca de contenidos a este banco.

source: Your Problem Bank is Empty
es_419: Tu banco de problemas está vacío

source: To start, add problems to the bank.
es_419: Para comenzar, agrega problemas al banco.

source: Problem Bank Summary
es_419: Resumen del banco de problemas

source: Total problems
es_419: Total de problemas

source: Selected to show
es_419: Seleccionados para mostrar

source: More problems selected than available.
es_419: Hay más problemas seleccionados que disponibles.

source: Press {link_start}Edit{link_end} to configure settings.
es_419: Presiona {link_start}Editar{link_end} para configurar los ajustes.

source: All
es_419: Todos

source: Shown to learners
es_419: Mostrados a los estudiantes

source: Selection Settings
es_419: Configuraciones de lógica de selección

source: To apply these changes, do it in the {link_start}Edit page{link_end}.
es_419: Para aplicar estos cambios, hágalo en la página de {link_start}Editar{link_end}.

source: General Bank:
es_419: Banco General:

source: Set 'Count' to your desired total.
es_419: Cambia 'Cantidad' al número de elementos a mostrar.

source: By Collections:
es_419: Por Colecciones:

source: Change 'Count' from -1 and click 'Refresh Collections'.
es_419: Cambia 'Cantidad' a un número diferente de -1 y haz click sobre 'Actualizar colecciones'.

source: Note:
es_419: Nota:

source: To revert to General Bank after using Collections, enter {link_start}Edit mode{link_end} and clear all collection data.
es_419: Para usar Banco General después de usar por Colecciones, entra en {link_start}Editar {link_end} y elimina la información relacionada a colecciones.

source: These are the problems in the bank:
es_419: Estos son los problemas en el banco:

source: Number of problems to show
es_419: Problemas a mostrar

source: Search problems by title or content...
es_419: Buscar problemas por título...

source: Search problems
es_419: Buscar problemas

source: Clear search
es_419: Limpiar búsqueda

source: No problems in this collection.
es_419: No hay problemas en esta colección.

source: No collections data available.
es_419: No hay datos de colecciones disponibles.

source: Press {link_start}View{link_end} to preview components.
es_419: Presiona {link_start}Ver{link_end} para previsualizar los componentes.

source: Refresh Collections
es_419: Actualizar colecciones

source: Exam Progress
es_419: Progreso del examen

source: Grade:
es_419: Calificación:

source: Passed
es_419: Aprobado

source: Goal:
es_419: Meta:

source: Attempt:
es_419: Intento:

source: No attempts remaining
es_419: No quedan intentos

source: Retry Exam
es_419: Reintentar examen

source: Submit Exam
es_419: Enviar examen

source: Start New Attempt?
es_419: ¿Iniciar nuevo intento?

source: Close dialog
es_419: Cerrar diálogo

source: If you continue:
es_419: Si continúas:

source: Your current progress will be reset.
es_419: Tu progreso actual será reiniciado.

source: A new set of random questions will be loaded.
es_419: Se cargará un nuevo conjunto de preguntas aleatorias.

source: This will count as an attempt.
es_419: Esto contará como un intento.

source: Cancel
es_419: Cancelar

source: Yes, Retry Exam
es_419: Sí, reintentar examen

source: Refreshing collections...
es_419: Actualizando colecciones...

source: Collections refreshed!
es_419: Colecciones actualizadas!

source: Failed to refresh collections
es_419: Fallo al actualizar colecciones

source: An error occurred while refreshing collections
es_419: Ha ocurrido un error al actualizar colecciones

source: Selection update failed
es_419: La actualización de selección falló

source: Could not save selection.
es_419: No se pudo guardar la selección.

source: Error submitting exam. Please try again.
es_419: Error al enviar el examen. Por favor, inténtalo de nuevo.

source: Error retrying the exam. Please try again.
es_419: Error al reintentar el examen. Por favor, inténtalo de nuevo.
